In [1]:
# Install Pandas

%pip install pandas

Requirement already satisfied: pandas in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Import Pandas

import pandas as pd

## DataFrames
A DataFrame is a two-dimensional labeled data structure with columns of potentially different data types, similar to a spreadsheet or SQL table. 
It provides a powerful and flexible way to manipulate and analyze structured data in Python, offering functionalities for data analysis.

In [3]:
# Creating an Empty Data Frame

df = pd.DataFrame()

In [4]:
# Creating a dataframe using a list of lists
data = [['Alice', 23], ['Ernest', 28], ['Troy', 25]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0   Alice   23
1  Ernest   28
2    Troy   25

In [5]:
# Creating Dataframe using a dictionary of lists
data = {
    'Name' : ['Alice', 'Ernest', 'Troy'],
    'Age' : [23, 28, 25]
}
df = pd.DataFrame(data)
df

     Name  Age
0   Alice   23
1  Ernest   28
2    Troy   25

In [6]:
# Creating a Dataframe using a list of dictionary
data = [{'Name': 'Alice', 'Age': 23}, {'Name': 'Ernest', 'Age': 28}, {'Name': 'Troy', 'Age': 25}]
df = pd.DataFrame(data)
df

     Name  Age
0   Alice   23
1  Ernest   28
2    Troy   25

## Series
A pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.). It's similar to a one-column table or an array with associated labels, providing powerful indexing and manipulation capabilities in Python.

In [7]:
s = pd.Series([1, 3, 5, 6, 7, 8])
s

0    1
1    3
2    5
3    6
4    7
5    8
dtype: int64

### **Pandas Data Types**
Numeric:
- Integer (int64): Represents whole numbers (e.g., 10, -5). This is the default integer type in pandas.
- Float (float64): Represents numbers with decimals (e.g., 3.14, -12.5).
- Boolean (bool): Represents logical True or False values.
- Object: This is a versatile but less efficient type that can store various data types like strings, lists, or custom objects. Pandas uses this type when it cannot infer a more specific data type.

In [8]:
# Integer (int64)

int_series = pd.Series([1, 3, 5, 6, 7, 8])
int_series

0    1
1    3
2    5
3    6
4    7
5    8
dtype: int64

In [9]:
# Float (float64)

float_series = pd.Series([3.14, 34.1, 1.02])
float_series

0     3.14
1    34.10
2     1.02
dtype: float64

In [10]:
# Boolean (bool)
bool_series = pd.Series([True, False, True])
bool_series

0     True
1    False
2     True
dtype: bool

In [11]:
# Object (object) - mixed data types
obj_series = pd.Series([1, 3.14, 'Test1', True])
obj_series

0        1
1     3.14
2    Test1
3     True
dtype: object

Specialized Data Types:
- Datetime (datetime64[ns]): Represents dates and times with nanosecond precision. Useful for time-series data analysis.
- Timedelta (timedelta64[ns]): Represents durations between timestamps.
- Categorical: Represents categorical data with predefined categories. Efficient for storing limited sets of categories.
- Sparse: Represents sparse data with many missing values. Stores data efficiently by only keeping non-zero values.

In [12]:
# DateTime (datetime64)
pd.to_datetime('2024-06-18')

# Datetime Series
datetime_series = pd.Series([pd.to_datetime('2024-06-18'), pd.to_datetime('2024-12-25'), pd.to_datetime('2025-01-01')])
datetime_series

0   2024-06-18
1   2024-12-25
2   2025-01-01
dtype: datetime64[ns]

In [13]:
# Timedelta (timedelta64)
pd.Timedelta(days=8, hours=13, minutes=30)

# Timedelta Series
timedelta_series = pd.Series([pd.Timedelta(days=8, hours=13, minutes=30), pd.Timedelta(hours=13, minutes=60), pd.Timedelta(hours=13, minutes=59) ])
timedelta_series

0   8 days 13:30:00
1   0 days 14:00:00
2   0 days 13:59:00
dtype: timedelta64[ns]

In [14]:
# Categorical (category)
pd.Categorical(["Sales", "Marketing", "Operations", "HR"])

# Categorical Series
category_series = pd.Series(pd.Categorical(["Sales", "Marketing", "Operations", "HR"]))
category_series

0         Sales
1     Marketing
2    Operations
3            HR
dtype: category
Categories (4, object): ['HR', 'Marketing', 'Operations', 'Sales']

In [15]:
# Sparse (Sparse[data type]) - array with missing values
sparse_series = pd.Series(pd.arrays.SparseArray([2, pd.NA, 4, pd.NA, 6, 7]))
sparse_series

0      2
1    NaN
2      4
3    NaN
4      6
5      7
dtype: Sparse[object, nan]

In [16]:
# Changing Datatypes
# Step 1: Check datatype
int_series.dtype

# Step 2: Change the datatype (float)
int_series = int_series.astype('float')
int_series

# Changing to String
int_series = int_series.astype('string')
int_series

0    1.0
1    3.0
2    5.0
3    6.0
4    7.0
5    8.0
dtype: string

#### **Example: Sales Data Analysis**
You have a dataset of sales transactions that includes the product name, quantity sold, and sale price. 
You want to analyze the data to find the total revenue per product.

In [17]:
data = {
    'Product Name':['A','B','C','A','B','A'],
    'Quantity Sold':[3,2,5,4,1,2],
    'Sale Price':[10,20,10,15,20,15]
}

# Step 1: Create a data
sales_df = pd.DataFrame(data)
sales_df

  Product Name  Quantity Sold  Sale Price
0            A              3          10
1            B              2          20
2            C              5          10
3            A              4          15
4            B              1          20
5            A              2          15

In [18]:
# Step 2: Get the Product name column
sales_df['Product Name']

0    A
1    B
2    C
3    A
4    B
5    A
Name: Product Name, dtype: object

In [19]:
# Step 3: Create a new table for Total Revenue for each row
sales_df['Total Revenue'] = sales_df['Quantity Sold'] * sales_df['Sale Price']
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [20]:
# Step 4: Group column values (groupby)
total_revenue = sales_df.groupby('Product Name')['Total Revenue'].sum()
total_revenue

Product Name
A    120
B     60
C     50
Name: Total Revenue, dtype: int64

In [21]:
# Step 5: Create a new dataframe to show the data in tabular format
results_df = pd.DataFrame()
results_df['Total Revenue'] = sales_df.groupby('Product Name')['Total Revenue'].sum()
results_df

              Total Revenue
Product Name
A                       120
B                        60
C                        50

### **Data Selection**
Pandas provides numerous methods for selecting and indexing data in Series and DataFrames, including label-based indexing with .loc, integer-position based indexing with .iloc, and conditional selection.

In [22]:
# Check the First Two Rows of Product Names
# [start:end] - similar to slicing of list
sales_df['Product Name'][0:2]

0    A
1    B
Name: Product Name, dtype: object

In [23]:
# Check the custom amount of rows for Quantity Sold
sales_df['Quantity Sold'][2:5]

2    5
3    4
4    1
Name: Quantity Sold, dtype: int64

In [24]:
# Check in twos
sales_df['Sale Price'][::2]

0    10
2    10
4    20
Name: Sale Price, dtype: int64

In [25]:
# Sum of Quantity Sold for the first two rows
sales_df['Quantity Sold'][0:2].sum()

np.int64(5)

np = numpy

Sometimes, it defaults to a library called "numpy" that handles number handling.

## Data Selection in DataFrames

In [26]:
"""
Index Location (.iloc)
- Will get rows based on a number/index.
- Will output into a DataFrame instead of a Series.
[start(included):end(excluded)]
"""

# Turn the first 3 rows into a new DataFrame
sales_df.iloc[0:3]

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50

In [27]:
"""
Location (.loc)
- Access a group of rows and columns by label(s) or a boolean array.
[start(included):end(included)]
"""
# Get only specific columns (Product Name and Sale Price)
sales_df.loc[0:3, ['Product Name', 'Sale Price']]

  Product Name  Sale Price
0            A          10
1            B          20
2            C          10
3            A          15

iloc[0:3] = get the first 3 rows

loc[0:3] = get the rows from label "0" to label "3"

In [28]:
# Conditional Filtering 
# Check for Total Revenues that are greater than or equal to 40
sales_df[sales_df['Total Revenue'] >= 40]

  Product Name  Quantity Sold  Sale Price  Total Revenue
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60

In [29]:
# Check for Products that are eqaul to A
sales_df[sales_df['Product Name'] == 'A']

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
3            A              4          15             60
5            A              2          15             30

In [30]:
# Check for Products that are eqaul to A
#dataframe[dataframe[column name from the datframe] operator 'condition']
sales_df[sales_df['Product Name'] == 'A']

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
3            A              4          15             60
5            A              2          15             30

**Example: Filtering Customer Reviews**
A DataFrame contains customer reviews for different products, including a numeric rating. You need to filter reviews to find all reviews of a specific product with a rating of 4 or higher.

In [31]:
reviews_data = {
    'ProductID': ['P1','P2','P3','P4','P5','P6','P7','P8','P9','P10'],
    'Rating': [5,3,2,1,4,3,2,4,6,1]
}

In [32]:
# Step 1: Create a dataframe
reviews_df = pd.DataFrame(reviews_data)
reviews_df

  ProductID  Rating
0        P1       5
1        P2       3
2        P3       2
3        P4       1
4        P5       4
5        P6       3
6        P7       2
7        P8       4
8        P9       6
9       P10       1

In [33]:
# Step 2: Ratings of Prodcuts that are 4 or higher
reviews_df[reviews_df['Rating'] >= 4]

  ProductID  Rating
0        P1       5
4        P5       4
7        P8       4
8        P9       6

## Pandas Operators
Data Loading and Exploration:
- head(): Shows the first few rows of a DataFrame
- tail(): Shows the last few rows of a DataFrame
- describe(): Generates summary statistics for each column (mean, standard deviation, etc.)
- info(): Displays information about the DataFrame, including data types and memory usage
Data Analysis:
- sum(): Calculates the sum of a Series or DataFrame
- mean(): Calculates the mean of a Series or DataFrame
- median(): Calculates the median of a Series or DataFrame
- std(): Calculates the standard deviation of a Series or DataFrame
- var(): Calculates the variance of a Series or DataFrame

In [34]:
# Recalling the Reviews DataFrame
reviews_df

  ProductID  Rating
0        P1       5
1        P2       3
2        P3       2
3        P4       1
4        P5       4
5        P6       3
6        P7       2
7        P8       4
8        P9       6
9       P10       1

In [35]:
# head(n)
# first 3 rows
reviews_df.head(3)
# default - gets the first 5 rows
reviews_df.head()

  ProductID  Rating
0        P1       5
1        P2       3
2        P3       2
3        P4       1
4        P5       4

In [36]:
# tail(n)
reviews_df.tail(4)

  ProductID  Rating
6        P7       2
7        P8       4
8        P9       6
9       P10       1

In [37]:
# describe() - count, std, min, max, percentiles
# low STD - data are close to the mean
# high STD - data are far to the mean
reviews_df.describe()
# reviews_df.describe(percentiles=[.1, .5, .9])

         Rating
count  10.00000
mean    3.10000
std     1.66333
min     1.00000
25%     2.00000
50%     3.00000
75%     4.00000
max     6.00000

In [38]:
# info()
reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ProductID  10 non-null     object
 1   Rating     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 292.0+ bytes

In [39]:
# Mean
reviews_df['Rating'].mean()

np.float64(3.1)

In [40]:
# sum
reviews_df['Rating'].sum()

np.int64(31)

In [41]:
# Median
reviews_df['Rating'].median()

np.float64(3.0)

In [42]:
# Standard Deviation ( how far apart our ratings are from the mean )
reviews_df['Rating'].std()

np.float64(1.66332999331662)

In [43]:
# Variance (This value indicate how much the data points in average, deviate from the mean squared)
reviews_df['Rating'].var()

np.float64(2.766666666666667)

## Importing and Exporting data

Pandas supports reading from and writing to a variety of files including CSV, Excel, SQL, making it easy to integrate with data analysis workflows.

In [44]:
# Turning a CSV file into a Dataframe
data = pd.read_csv('example.csv')
data

          A    B     C
0  1.000000  5.0  10.0
1  2.000000  6.5  11.0
2  2.333333  6.5  12.0
3  4.000000  8.0  11.0

In [45]:
# Turing an Excel file to a DataFrame
# This will let us export to excel file
%pip install openpyxl

Requirement already satisfied: openpyxl in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (3.1.4)
Requirement already satisfied: et-xmlfile in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [46]:
# Export Dataframe to an Excel file
data.to_excel('exported_data.xlsx', sheet_name="Example Sheet", index=False)

In [47]:
# Export Dataframe to a CSV file
data.to_csv('exported_data.csv', index=False)

**Example: Importing Sales Data and Exporting Analysis**
Assume you have a CSV file, sales.csv, containing sales data. You need to import this data, calculate the total sales, and export the summary to a new file.

In [48]:
# Step 1: Import sales.csv into our notebook
sales_df = pd.read_csv('sales.csv')
sales_df

  Product Name  Quantity Sold  Sale Price
0    Product A              3          10
1    Product B              2          20
2    Product A              5          10
3    Product C              4          15
4    Product B              1          20
5    Product C              2          15

In [49]:
# Step 2: Getting the total revenue per row
sales_df['Total Revenue'] = sales_df['Quantity Sold'] * sales_df['Sale Price']
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0    Product A              3          10             30
1    Product B              2          20             40
2    Product A              5          10             50
3    Product C              4          15             60
4    Product B              1          20             20
5    Product C              2          15             30

In [50]:
# Step 3: Adding all totals together
total_revenue = sales_df['Total Revenue'].sum()
total_revenue

np.int64(230)

In [51]:
# Step 4: Creating a Dataframe for Total Sales
summary_df = pd.DataFrame([{'Total Sales': total_revenue}])
summary_df

   Total Sales
0          230

In [52]:
# Step 5: Export the summary to a CSV file
summary_df.to_csv('sales_summary.csv', index=False)

## Apply
The apply function in pandas is a powerful tool for working with DataFrames. It allows you to apply a custom function to each element (row or column) of the DataFrame and return a new DataFrame or Series based on the results.

In [53]:
data = {
    "Age": [25, 30, 22],
    "Names": ["Jeff", "John", "Joey"]
}
df = pd.DataFrame(data)
df

   Age Names
0   25  Jeff
1   30  John
2   22  Joey

In [54]:
# Square Values
def square(x):
    return x*x
df['AgeSquared'] = df['Age'].apply(square)
df

   Age Names  AgeSquared
0   25  Jeff         625
1   30  John         900
2   22  Joey         484

In [55]:
# Adding Prefix
def add_prefix(name):
    return "Mr. " + name
df['Full Name'] = df['Names'].apply(add_prefix)
df

   Age Names  AgeSquared Full Name
0   25  Jeff         625  Mr. Jeff
1   30  John         900  Mr. John
2   22  Joey         484  Mr. Joey

In [56]:
# Filtering
def below_30(age):
    return age < 30
# Conditional Filtering
df_filtered = df[df["Age"].apply(below_30)]
df_filtered

   Age Names  AgeSquared Full Name
0   25  Jeff         625  Mr. Jeff
2   22  Joey         484  Mr. Joey